tap "ajrosen/icalpal"
tap "bric3/tap"
tap "felixkratz/formulae", "https://github.com/FelixKratz/homebrew-formulae"
tap "homebrew/services"
tap "jenkins-zh/jcli"
tap "local/local"
tap "mongodb/brew"
tap "ngrok/ngrok"
tap "sachaos/todoist"
# Sampling CPU & HEAP profiler for Java using AsyncGetCallTrace + perf_events
brew "async-profiler"
# Securely manage AWS API credentials using AWS SSO
brew "aws-sso-cli"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# Official Amazon AWS command-line interface
brew "awscli"
# Change macOS display brightness from the command-line
brew "brightness"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Emacs dependency management
brew "cask"
# Cross-platform make
brew "cmake"
# Powerful, clean, object-oriented scripting language
brew "ruby", link: false
# Dependency manager for Cocoa projects
brew "cocoapods"
# Modern diagram scripting language that turns text to diagrams
brew "d2"
# Kubernetes command-line interface
brew "kubernetes-cli"
# CLI helps develop/deploy/debug apps with Docker and k8s
brew "devspace"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Text processing system for reStructuredText
brew "docutils"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Easiest way to build and release mobile apps
brew "fastlane"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# OpenType text shaping engine
brew "harfbuzz"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Much more powerful alternative to kubectx and kubens
brew "kubie"
# Postgres C API library
brew "libpq", link: true
# Powerful, lightweight programming language
brew "lua"
# Securely transfers data between computers
brew "magic-wormhole"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Atlas CLI enables you to manage your MongoDB Atlas
brew "mongodb-atlas-cli"
# Node version management
brew "n"
# Development kit for the Java programming language
brew "openjdk"
# Simplistic interactive filtering tool
brew "peco"
# General-purpose scripting language
brew "php"
# Python version management
brew "pyenv"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
# Powerful, clean, object-oriented scripting language
brew "ruby@3.1"
# Easy and Repeatable Kubernetes Development
brew "skaffold"
# Powerful console-based newsreader
brew "slrn"
# Compression/decompression library aiming for high speed
brew "snappy"
# User interface to the TELNET protocol
brew "telnet"
# Threaded, NNTP-, and spool-based UseNet newsreader
brew "tin"
# JavaScript package manager
brew "yarn"
# Collect and visualize traces written in Zipkin format
brew "zipkin"
cask "font-hack-nerd-font"
# Desktop automation application
cask "hammerspoon"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok/ngrok/ngrok"
# Open-source version of the X.Org X Window System
cask "xquartz"
vscode "alefragnani.project-manager"
vscode "anysphere.remote-containers"
vscode "anysphere.remote-ssh"
vscode "ardonplay.vscode-jetbrains-icon-theme"
vscode "be5invis.vscode-custom-css"
vscode "dendron.dendron"
vscode "dendron.dendron-paste-image"
vscode "dracula-theme.theme-dracula"
vscode "johnpapa.vscode-peacock"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "pkief.material-icon-theme"
vscode "pomdtr.excalidraw-editor"
vscode "redhat.vscode-yaml"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "timdeen.darcula"
vscode "vscodevim.vim"
vscode "yurierherrera.todo4vcode"
vscode "yzhang.markdown-all-in-one"
vscode "zerodind.familiar-java-themes"
npm "@anthropic-ai/claude-code"
npm "corepack"
