alefragnani.project-manager
anysphere.remote-containers
anysphere.remote-ssh
ardonplay.vscode-jetbrains-icon-theme
be5invis.vscode-custom-css
dendron.dendron
dendron.dendron-paste-image
dracula-theme.theme-dracula
johnpapa.vscode-peacock
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
pkief.material-icon-theme
pomdtr.excalidraw-editor
redhat.vscode-yaml
scala-lang.scala
scalameta.metals
timdeen.darcula
vscodevim.vim
yurierherrera.todo4vcode
yzhang.markdown-all-in-one
zerodind.familiar-java-themes
